In [16]:
import pandas as pd
import os

# Importing dataset

In [17]:
df = pd.read_csv("/home/rajan/Datathon/Datathon Final dataset/Total Male and female voters per districts.csv")

In [18]:
df.head()

       District   Male  Female  Third Gender   Total
0        Achham  60441   67299             2  127742
1  Arghakhanchi  60296   66403             0  126699
2       Baglung  73963   82839             0  156802
3       Baitadi  60227   64596             1  124824
4       Bajhang  47888   49721             1   97610

In [19]:
df.shape

(80, 5)

In [20]:
df.isnull().sum()

District        0
Male            0
Female          0
Third Gender    0
Total           0
dtype: int64

In [21]:
for i in df['District']:
    print(i)

Achham
Arghakhanchi
Baglung
Baitadi
Bajhang
Bajura
Banke
Bara
Bardiya
Bhaktapur
Bhojpur
Chitwan
Dadeldhura
Dailekh
Dang
Tanahu
Darchula
Dhading
Dhankuta
Dhanusa
Dolakha
Dolpa
Doti
Gorkha
Gulmi
Humla
Ilam
Jajarkot
Jajarkot
Jajarkot
Jhapa
Jumla
Kailali
Kalikot
Kanchanpur
Kapilbastu
Kaski
Kathmandu
Kavrepalanchok
Khotang
Lalitpur
Lamjung
Mahottari
Makwanpur
Manang
Morang
Mugu
Mustang
Myagdi
Nawalparasi (East)
Nawalparasi (East)
Nuwakot
Okhaldhunga
Palpa
Panchthar
Parbat
Parsa
Pyuthan
Ramechhap
Rasuwa
Rautahat
Rolpa
Rukum
Rupandehi
Salyan
Sankhuwasabha
Saptari
Sarlahi
Sindhuli
Sindhupalchok
Siraha
Solukhumbu
Sunsari
Surkhet
Syangja
Tanahu
Taplejung
Terhathum
Udayapur
Total

In [27]:
df.drop(index = 79, inplace = True)

In [28]:
df.duplicated().sum()

3

In [35]:
df.drop_duplicates(inplace =True)

In [36]:
df.head()

       District   Male  Female  Third Gender   Total
0        Achham  60441   67299             2  127742
1  Arghakhanchi  60296   66403             0  126699
2       Baglung  73963   82839             0  156802
3       Baitadi  60227   64596             1  124824
4       Bajhang  47888   49721             1   97610

In [37]:
df[df['Female']==max(df['Female'])]

   District   Male   Female  Third Gender   Total
15   Tanahu  90144  3104327             0  194471

In [38]:
df[df['Male']==max(df['Male'])]

              District    Male  Female  Third Gender    Total
49  Nawalparasi (East)  682596   68584             1   131181

In [39]:
df[df['Total']==max(df['Total'])]

    District   Male  Female  Third Gender Total
27  Jajarkot  42410   36536             1  ????